### Dataset Description

#### Context
Typically e-commerce datasets are proprietary and consequently hard to find among publicly available data. However, The UCI Machine Learning Repository has made this dataset containing actual transactions from 2010 and 2011. The dataset is maintained on their site, where it can be found by the title "Online Retail".

#### Content
"This is a transnational data set which contains all the transactions occurring between 01/12/2010 and 09/12/2011 for a UK-based and registered non-store online retail.The company mainly sells unique all-occasion gifts. Many customers of the company are wholesalers."

#### Data Rundown
Company - UK-based and registered non-store online retail

Products for selling - Mainly all-occasion gifts

Customers - Most are wholesalers (local or international)

Transactions Period - 1st Dec 2010 - 9th Dec 2011 (One year)

### Import Libraries

In [52]:
import pandas as pd
import numpy as np

import seaborn as sns
import matplotlib as plt
%matplotlib inline
color = sns.color_palette('pastel')

There is a date column in our dataset, so we'll import datetime library to ensure we can work easily with the column.

In [53]:
import datetime

Importing and setting the warnings library to ignore will stop the red warning blocks popping up when certain pieces of code are run.
This is only blocking the warnings that pop up when the code works, not ones when the code breaks.

In [81]:
import warnings
warnings.filterwarnings('ignore')

### Import Data

In [28]:
pd.set_option('display.max_columns', 100)
pd.set_option('display.max_rows', 10000)

In [29]:
df = pd.read_csv('e-commerce-data.csv', encoding='ISO-8859-1')

##### Note:
encoding='ISO-8859-1' prevents the error:

*UnicodeDecodeError: 'utf-8' codec can't decode byte 0xa3 in position 28: invalid start byte*

### Explore Data

In [30]:
df.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [31]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
InvoiceNo      541909 non-null object
StockCode      541909 non-null object
Description    540455 non-null object
Quantity       541909 non-null int64
InvoiceDate    541909 non-null object
UnitPrice      541909 non-null float64
CustomerID     406829 non-null float64
Country        541909 non-null object
dtypes: float64(2), int64(1), object(5)
memory usage: 33.1+ MB

In [32]:
df.describe()

            Quantity      UnitPrice     CustomerID
count  541909.000000  541909.000000  406829.000000
mean        9.552250       4.611114   15287.690570
std       218.081158      96.759853    1713.600303
min    -80995.000000  -11062.060000   12346.000000
25%         1.000000       1.250000   13953.000000
50%         3.000000       2.080000   15152.000000
75%        10.000000       4.130000   16791.000000
max     80995.000000   38970.000000   18287.000000

In [33]:
df.shape

(541909, 8)

In [34]:
df.columns

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

##### Note:
I am going to change the column names away from Camel Case.

In [35]:
df.rename(index=str,columns={
                            'InvoiceNo':'invoice_num',
                            'StockCode':'stock_code',
                            'Description':'description',
                            'Quantity':'quantity',
                            'InvoiceDate':'invoice_date',
                            'UnitPrice':'unit_price',
                            'CustomerID':'customer_id',
                            'Country':'country'
                            },inplace=True)

In [36]:
df.head()

,invoice_num,stock_code,description,quantity,invoice_date,unit_price,customer_id,country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

### Data Cleaning

In [ ]:
Check for missing values in each column.

In [39]:
df.isnull().sum().sort_values(ascending=False)

customer_id     135080
description       1454
country              0
unit_price           0
invoice_date         0
quantity             0
stock_code           0
invoice_num          0
dtype: int64

##### Note:

**df.isnull().any(axis=1)** will display True or False for every row (when axis=1). True if it contains a Null/NaN value. False if it does not.

Therefore, the below command allows us to view some of the rows containing a Null/NaN value.

In [45]:
df[df.isnull().any(axis=1)].head(10)

,invoice_num,stock_code,description,quantity,invoice_date,unit_price,customer_id,country
622,536414,22139,NaN,56,12/1/2010 11:52,0.00,NaN,United Kingdom
1443,536544,21773,DECORATIVE ROSE BATHROOM BOTTLE,1,12/1/2010 14:32,2.51,NaN,United Kingdom
1444,536544,21774,DECORATIVE CATS BATHROOM BOTTLE,2,12/1/2010 14:32,2.51,NaN,United Kingdom
1445,536544,21786,POLKADOT RAIN HAT,4,12/1/2010 14:32,0.85,NaN,United Kingdom
1446,536544,21787,RAIN PONCHO RETROSPOT,2,12/1/2010 14:32,1.66,NaN,United Kingdom
1447,536544,21790,VINTAGE SNAP CARDS,9,12/1/2010 14:32,1.66,NaN,United Kingdom
1448,536544,21791,VINTAGE HEADS AND TAILS CARD GAME,2,12/1/2010 14:32,2.51,NaN,United Kingdom
1449,536544,21801,CHRISTMAS TREE DECORATION WITH BELL,10,12/1/2010 14:32,0.43,NaN,United Kingdom
1450,536544,21802,CHRISTMAS TREE HEART DECORATION,9,12/1/2010 14:32,0.43,NaN,United Kingdom
1451,536544,21803,CHRISTMAS TREE STAR DECORATION,11,12/1/2010 14:32,0.43,NaN,United Kingdom

In [51]:
df['invoice_date'].dtype

dtype('O')

In [54]:
df['invoice_date'][0]

'12/1/2010 8:26'

We see the invoice_date column is of type object, specifically it is a string. Lets convert it to datetime, using the datetime library we imported earlier.

In [69]:
df['invoice_date'] = pd.to_datetime(df['invoice_date'], format='%m/%d/%Y %H:%M')

In [70]:
df['invoice_date'][0]

Timestamp('2010-12-01 08:26:00')

The Uppercase Description entries don't look great, let's change them to Lowercase.

In [71]:
df['description'] = df['description'].str.lower()

In [72]:
df.head()

,invoice_num,stock_code,description,quantity,invoice_date,unit_price,customer_id,country
0,536365,85123A,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,white metal lantern,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

### Deal with Missing Values

In [161]:
df_new = df.dropna()

In [162]:
df_new.isnull().sum()

invoice_num     0
stock_code      0
description     0
quantity        0
invoice_date    0
unit_price      0
customer_id     0
country         0
dtype: int64

In [163]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Index: 406829 entries, 0 to 541908
Data columns (total 8 columns):
invoice_num     406829 non-null object
stock_code      406829 non-null object
description     406829 non-null object
quantity        406829 non-null int64
invoice_date    406829 non-null datetime64[ns]
unit_price      406829 non-null float64
customer_id     406829 non-null float64
country         406829 non-null object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 27.9+ MB

The customer_id column doesn't need the decimal point either. Lets change this column to integers.

Note: We needed to drop the Null values before doing this to avoid getting an error.

In [164]:
df_new['customer_id'] = df_new['customer_id'].astype('int64')

### Further Cleaning

In [165]:
df_new.describe().round(2)

        quantity  unit_price  customer_id
count  406829.00   406829.00    406829.00
mean       12.06        3.46     15287.69
std       248.69       69.32      1713.60
min    -80995.00        0.00     12346.00
25%         2.00        1.25     13953.00
50%         5.00        1.95     15152.00
75%        12.00        3.75     16791.00
max     80995.00    38970.00     18287.00

Looking at our data description here, what jumps out is that there is a quantity min value that is negative. Quantity should always be positive so lets remove all rows where there is a negative quantity value.

In [166]:
df_new = df_new[df_new['quantity'] > 0]

In [167]:
df_new.describe().round(2)

        quantity  unit_price  customer_id
count  397924.00   397924.00    397924.00
mean       13.02        3.12     15294.32
std       180.42       22.10      1713.17
min         1.00        0.00     12346.00
25%         2.00        1.25     13969.00
50%         6.00        1.95     15159.00
75%        12.00        3.75     16795.00
max     80995.00     8142.75     18287.00

Okay we are looking good and the data is looking clean. Let's add a few columns based off of the columns/info we have already that might be useful for analyzing the data.

##### Add Amount Spent Column

In [168]:
df_new['amount_spent'] = df_new['quantity'] * df_new['unit_price']

In [169]:
df_new[['quantity','unit_price','amount_spent']].head(3)

   quantity  unit_price  amount_spent
0         6        2.55         15.30
1         6        3.39         20.34
2         8        2.75         22.00

##### Add Month, Day, Hour Columns as well as a Year-Month Column based off of the invoice_date column

In [170]:
df.columns

Index(['invoice_num', 'stock_code', 'description', 'quantity', 'invoice_date',
       'unit_price', 'customer_id', 'country'],
      dtype='object')

Note: invoice_date is the column in position 4.

In [171]:
df_new.insert(loc=5, column='year_month', value=df_new['invoice_date'].map(lambda x : 100*x.year + x.month))
df_new.insert(loc=6, column='month', value=df_new['invoice_date'].dt.month)
df_new.insert(loc=7, column='day', value=df_new['invoice_date'].dt.day+1)
df_new.insert(loc=8, column='hour', value=df_new['invoice_date'].dt.hour)

# The +1 in 'day' makes Monday = 1, Sunday = 7.

In [172]:
df_new.head()

,invoice_num,stock_code,description,quantity,invoice_date,year_month,month,day,hour,unit_price,customer_id,country,amount_spent
0,536365,85123A,white hanging heart t-light holder,6,2010-12-01 08:26:00,201012,12,2,8,2.55,17850,United Kingdom,15.30
1,536365,71053,white metal lantern,6,2010-12-01 08:26:00,201012,12,2,8,3.39,17850,United Kingdom,20.34
2,536365,84406B,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,201012,12,2,8,2.75,17850,United Kingdom,22.00
3,536365,84029G,knitted union flag hot water bottle,6,2010-12-01 08:26:00,201012,12,2,8,3.39,17850,United Kingdom,20.34
4,536365,84029E,red woolly hottie white heart.,6,2010-12-01 08:26:00,201012,12,2,8,3.39,17850,United Kingdom,20.34

### Rearrange Column Order

In [173]:
df_new = df_new[['invoice_num','invoice_date', 'year_month', 'month', 'day', 'hour', 'stock_code',
                 'description','quantity','unit_price','amount_spent','customer_id','country']]

In [174]:
df_new.head()

,invoice_num,invoice_date,year_month,month,day,hour,stock_code,description,quantity,unit_price,amount_spent,customer_id,country
0,536365,2010-12-01 08:26:00,201012,12,2,8,85123A,white hanging heart t-light holder,6,2.55,15.30,17850,United Kingdom
1,536365,2010-12-01 08:26:00,201012,12,2,8,71053,white metal lantern,6,3.39,20.34,17850,United Kingdom
2,536365,2010-12-01 08:26:00,201012,12,2,8,84406B,cream cupid hearts coat hanger,8,2.75,22.00,17850,United Kingdom
3,536365,2010-12-01 08:26:00,201012,12,2,8,84029G,knitted union flag hot water bottle,6,3.39,20.34,17850,United Kingdom
4,536365,2010-12-01 08:26:00,201012,12,2,8,84029E,red woolly hottie white heart.,6,3.39,20.34,17850,United Kingdom

Great! Data Cleaning done.

### Exploratory Data Analysis (EDA)

We'll explore the data in the following ways:
1. Order Count and Amount Spent by Customer
2. Patterns in when Orders are made (month/day/hour)
3. Patterns in Unit Prices
4. Patterns in Spending by Country